import Style from './index.style';

const Privacy = () => (
  <Style>
    <div className="terms-container">
      <div className="terms-content">
        <h1> นโยบายความเป็นส่วนตัว </h1>

        <h2> การใช้และการเปิดเผยข้อมูลส่วนตัว </h2>

        บริษัทจะใช้ข้อมูลส่วนที่ได้รับจากผู้ใช้งาน หรือส่งต่อแก่บุคคลภายนอก (รวมถึงบริษัทที่เกี่ยวข้อง ผู้ให้บริการซึ่งเป็นบุคคลภายนอก) เพื่อประโยชน์ของกิจการทั้งหมดหรือแต่บางส่วนดังต่อไปนี้
        <ol>
          <li>เพื่อการใช้งานแพลตฟอร์มของเว็บไซต์</li>
          <li>เพื่อการระบุตัวตนผู้เข้าใช้งาน</li>
          <li>เพื่อการวิเคราะห์สถิติและพฤติกรรมของผู้ใช้งาน</li>
          <li>เพื่อการพัฒนาการให้บริการรูปแบบใหม่ ที่บริษัทคาดว่าจะมีประโยชน์สำหรับผู้ใช้งานหรือที่ได้รับการร้องขอจากผู้ใช้งาน</li>
          <li>เพื่อพัฒนาผลิตภัณฑ์ทางด้านการศึกษา ที่เหมาะสมและน่าจะเป็นประโยชน์ต่อผู้ใช้งานเว็บไซต์ Lermo ร่วมกับบริษัทผู้รับประกันต่างๆ</li>
          <li>เมื่อผู้ใช้งานได้สมัครเพื่อเปิดบัญชีการใช้บริการกับเว็บไซต์ หรือได้ส่งมอบข้อมูลส่วนตัวของผู้ใช้งานผ่านทางแพลตฟอร์มเพื่อส่งข้อมูลข่าวสารทางการตลาดและโปรโมชั่นต่างๆ เกี่ยวกับสินค้าหรือบริการของบริษัทหรือของผู้ให้บริการที่เป็นบุคคลภายนอกเป็นครั้งคราว ผู้ใช้งานสามารถยกเลิกการรับข้อมูลการตลาดได้ตลอดเวลา โดยการใช้ระบบการยกเลิกการรับข้อมูลที่อยู่ในข้อมูลทางการตลาดที่จัดส่งให้</li>
          <li>ในกรณีที่เป็นข้อยกเว้นและ บริษัทถูกขอให้เปิดเผยข้อมูลส่วนตัวของผู้ใช้งาน เช่นในกรณีที่มีมูลเหตุให้เชื่อว่าการเปิดเผยดังกล่าวอาจป้องกันการข่มขู่ต่อชีวิตหรือร่างกาย หรือเพื่อวัตถุประสงค์ในการบังคับใช้กฎหมาย หรือการปฏิบัติตามกฎหมาย ระเบียบ ข้อบังคับหรือการร้องขออื่นใด</li>
          <li>บริษัทไม่ได้ประกอบธุรกิจหรือมีนโยบายในการค้าข้อมูลส่วนตัวของผู้ใช้งานต่อบุคคลภายนอก</li>
        </ol>

        <h2> ความปลอดภัยของข้อมูลส่วนตัวของท่าน </h2>
        บริษัทขอรับรองว่าข้อมูลที่จัดเก็บทั้งหมดจะถูกจัดเก็บอย่างปลอดภัย โดยบริษัทจะป้องกันข้อมูลส่วนตัวของผู้ใช้งานโดยจำกัดการเข้าถึงข้อมูลส่วนตัวจัดให้มีวิธีการทางเทคโนโลยีเพื่อป้องกันไม่ให้มีการเข้าสู่ระบบคอมพิวเตอร์โดยที่ไม่ได้รับอนุญาต จัดการทำลายข้อมูลส่วนตัวของผู้ใช้งานเพื่อความปลอดภัยเมื่อข้อมูลดังกล่าวไม่จำเป็นสำหรับวัตถุประสงค์ทางกฎหมายและธุรกิจอีกต่อไป หากผู้ใช้งานมีเหตุให้เชื่อว่าความเป็นส่วนตัวของผู้ใช้งานได้ถูกบริษัทกระทำการละเมิด สามารถติดต่อมายังบริษัทผ่านทางอีเมลที่ระบุข้างล่าง

        <h2> ไม่มีข้อมูลขยะ สแปม สปายแวร์ หรือ ไวรัส </h2>
        ข้อมูลขยะ (Spam) สปายแวร์ (Spyware) หรือ ไวรัส (Virus) นั้นไม่ได้รับอนุญาตบนแพลตฟอร์ม กรุณาตั้งค่าและคงสภาพความต้องการ (Preference) ในการติดต่อสื่อสารเพื่อที่บริษัทจะได้ส่งข้อมูลการติดต่อสื่อสารตามที่ผู้ใช้งานต้องการ โดยที่ผู้ใช้งานจะไม่ได้รับข้อความใดๆที่มีลักษณะเป็น ข้อมูลขยะ สแปม สปายแวร์ หรือ ไวรัสผ่านทางแพลตฟอร์ม หากผู้ใช้งานต้องการรายงานข้อความที่น่าสงสัยให้บริษัททราบ สามารถติดต่อผ่านทางอีเมลที่ระบุข้างล่าง

        <h2> การเปลี่ยนแปลงนโยบายความเป็นส่วนตัว </h2>
        บริษัทจะตรวจสอบประสิทธิภาพของนโยบายความเป็นส่วนตัวอยู่เสมอบริษัทจึงขอสงวนสิทธิในการเปลี่ยนแปลงนโยบายความเป็นส่วนได้ตลอดเวลา การเปลี่ยนแปลงนโยบายดังกล่าวจะถูกประกาศหรือตีพิมพ์ไว้ในแพลตฟอร์ม

        <h2> การใช้งาน Google Analytics  </h2>
        Lermo มีการใช้งาน Google Analytics เพื่อเรียกดูข้อมูลการใช้งานของผู้ใช้ รวมถึง แต่ไม่จำกัดเฉพาะข้อมูลของเบราเซอร์ ข้อมูลของอุปกรณ์ ประเทศที่อยู่ เพื่อจุดประสงค์ในการพัฒนาปรับปรุงประสบการณ์การใช้งานแพลตฟอร์มให้ดียิ่งขึ้น รวมถึงนำข้อมูลพฤติกรรมการใช้งานเพื่อการนำเสนอและโฆษณาสินค้าและบริการของLermo ที่เหมาะสมกับผู้ใช้แต่ละราย โดยไม่มีการเปิดเผยข้อมูลดังกล่าวให้กับบุคคลอื่นใดนอกเหนือจากใช้งานภายในบริษัทฯ

        หากผู้ใช้ไม่ต้องการให้ Google Analytics สามารถเข้าถึงข้อมูลการใช้งานของผู้ใช้ได้ สามารถเลือกที่จะปิดการบันทึกการใช้งานผ่านเครื่องมือของ Google ทาง https://tools.google.com/dlpage/gaoptout/

        <h2> การเพิกถอนความยินยอม </h2>
        ผู้ใช้งานอาจส่งคำคัดค้านการใช้หรือการเปิดเผยข้อมูลส่วนตัวของผู้ใช้งานสำหรับกิจการต่างๆหรือเพื่อวัตถุประสงค์ที่ระบุไว้ด้านบน แก่บริษัทได้ตลอดเวลา โดยติดต่อผ่านทางอีเมลที่ระบุด้านล่าง และบริษัทขอเรียนให้ทราบว่าหากผู้ใช้งานได้ส่งคำคัดค้านการใช้หรือการเปิดเผยข้อมูลส่วนตัวของผู้ใช้งานสำหรับกิจการต่างๆ หรือเพื่อวัตถุประสงค์ที่ระบุไว้ด้านบน บริษัทอาจไม่อยู่ในสถานะที่จะบริการหรือปฏิบัติตามสัญญาแก่ผู้ใช้งานได้ บริษัทจึงขอสงวนสิทธิทางกฎหมายและการเยียวยา ในกรณีที่บริษัทไม่สามารถให้บริการแก่ผู้ใช้งานหรือปฏิบัติตามสัญญาต่อผู้ใช้งานได้อันเกิดจากคำคัดค้านดังกล่าว

        <h2> ติดต่อ Lermo </h2>
        หากผู้ใช้งานต้องการเพิกถอนความยินยอมในการใช้ข้อมูลส่วนตัวของท่าน ขอเรียกดูข้อมูลและ/หรือข้อมูลส่วนตัว มีคำถาม ความคิดเห็น ข้อกังวล หรือขอความช่วยเหลือทางด้านเทคนิค หรือเกี่ยวกับโปรแกรมคุกกี้ (cookies) กรุณาติดต่อเราได้ ที่นี่
        อีเมล contact@lermo.io
      </div>
    </div>

  </Style>
);

export default Privacy;
